Microchip-MPLAB-Harmony/csp_apps_sam_a5d2/apps/mcan/mcan_fd_operation_blocking/firmware/src/packs/ATSAMA5D29_DFP/component/pio.h
/* -------- PIO_S_PIO_IMR : (PIO Offset: 0x28) ( R/ 32) Secure PIO Interrupt Mask Register -------- */
#define PIO_S_PIO_IMR_P0_Pos                  _UINT32_(0)                                          /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Position */
#define PIO_S_PIO_IMR_P0_Msk                  (_UINT32_(0x1) << PIO_S_PIO_IMR_P0_Pos)              /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Mask */
#define PIO_S_PIO_IMR_P0(value)               (PIO_S_PIO_IMR_P0_Msk & (_UINT32_(value) << PIO_S_PIO_IMR_P0_Pos)) /* Assigment of value for P0 in the PIO_S_PIO_IMR register */
#define PIO_S_PIO_IMR_P1_Pos                  _UINT32_(1)                                          /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Position */
#define PIO_S_PIO_IMR_P1_Msk                  (_UINT32_(0x1) << PIO_S_PIO_IMR_P1_Pos)              /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Mask */
#define PIO_S_PIO_IMR_P1(value)               (PIO_S_PIO_IMR_P1_Msk & (_UINT32_(value) << PIO_S_PIO_IMR_P1_Pos)) /* Assigment of value for P1 in the PIO_S_PIO_IMR register */
#define PIO_S_PIO_IMR_P2_Pos                  _UINT32_(2)                                          /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Position */
#define PIO_S_PIO_IMR_P2_Msk                  (_UINT32_(0x1) << PIO_S_PIO_IMR_P2_Pos)              /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Mask */
#define PIO_S_PIO_IMR_P2(value)               (PIO_S_PIO_IMR_P2_Msk & (_UINT32_(value) << PIO_S_PIO_IMR_P2_Pos)) /* Assigment of value for P2 in the PIO_S_PIO_IMR register */
#define PIO_S_PIO_IMR_P3_Pos                  _UINT32_(3)                                          /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Position */
#define PIO_S_PIO_IMR_P3_Msk                  (_UINT32_(0x1) << PIO_S_PIO_IMR_P3_Pos)              /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Mask */
#define PIO_S_PIO_IMR_P3(value)               (PIO_S_PIO_IMR_P3_Msk & (_UINT32_(value) << PIO_S_PIO_IMR_P3_Pos)) /* Assigment of value for P3 in the PIO_S_PIO_IMR register */
#define PIO_S_PIO_IMR_P4_Pos                  _UINT32_(4)                                          /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Position */
#define PIO_S_PIO_IMR_P4_Msk                  (_UINT32_(0x1) << PIO_S_PIO_IMR_P4_Pos)              /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Mask */
#define PIO_S_PIO_IMR_P4(value)               (PIO_S_PIO_IMR_P4_Msk & (_UINT32_(value) << PIO_S_PIO_IMR_P4_Pos)) /* Assigment of value for P4 in the PIO_S_PIO_IMR register */
#define PIO_S_PIO_IMR_P5_Pos                  _UINT32_(5)                                          /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Position */
#define PIO_S_PIO_IMR_P5_Msk                  (_UINT32_(0x1) << PIO_S_PIO_IMR_P5_Pos)              /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Mask */
#define PIO_S_PIO_IMR_P5(value)               (PIO_S_PIO_IMR_P5_Msk & (_UINT32_(value) << PIO_S_PIO_IMR_P5_Pos)) /* Assigment of value for P5 in the PIO_S_PIO_IMR register */
#define PIO_S_PIO_IMR_P6_Pos                  _UINT32_(6)                                          /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Position */
#define PIO_S_PIO_IMR_P6_Msk                  (_UINT32_(0x1) << PIO_S_PIO_IMR_P6_Pos)              /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Mask */
#define PIO_S_PIO_IMR_P6(value)               (PIO_S_PIO_IMR_P6_Msk & (_UINT32_(value) << PIO_S_PIO_IMR_P6_Pos)) /* Assigment of value for P6 in the PIO_S_PIO_IMR register */
#define PIO_S_PIO_IMR_P7_Pos                  _UINT32_(7)                                          /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Position */
#define PIO_S_PIO_IMR_P7_Msk                  (_UINT32_(0x1) << PIO_S_PIO_IMR_P7_Pos)              /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Mask */
#define PIO_S_PIO_IMR_P7(value)               (PIO_S_PIO_IMR_P7_Msk & (_UINT32_(value) << PIO_S_PIO_IMR_P7_Pos)) /* Assigment of value for P7 in the PIO_S_PIO_IMR register */
#define PIO_S_PIO_IMR_P8_Pos                  _UINT32_(8)                                          /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Position */
#define PIO_S_PIO_IMR_P8_Msk                  (_UINT32_(0x1) << PIO_S_PIO_IMR_P8_Pos)              /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Mask */
#define PIO_S_PIO_IMR_P8(value)               (PIO_S_PIO_IMR_P8_Msk & (_UINT32_(value) << PIO_S_PIO_IMR_P8_Pos)) /* Assigment of value for P8 in the PIO_S_PIO_IMR register */
#define PIO_S_PIO_IMR_P9_Pos                  _UINT32_(9)                                          /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Position */
#define PIO_S_PIO_IMR_P9_Msk                  (_UINT32_(0x1) << PIO_S_PIO_IMR_P9_Pos)              /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Mask */
#define PIO_S_PIO_IMR_P9(value)               (PIO_S_PIO_IMR_P9_Msk & (_UINT32_(value) << PIO_S_PIO_IMR_P9_Pos)) /* Assigment of value for P9 in the PIO_S_PIO_IMR register */
#define PIO_S_PIO_IMR_P10_Pos                 _UINT32_(10)                                         /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Position */
#define PIO_S_PIO_IMR_P10_Msk                 (_UINT32_(0x1) << PIO_S_PIO_IMR_P10_Pos)             /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Mask */
#define PIO_S_PIO_IMR_P10(value)              (PIO_S_PIO_IMR_P10_Msk & (_UINT32_(value) << PIO_S_PIO_IMR_P10_Pos)) /* Assigment of value for P10 in the PIO_S_PIO_IMR register */
#define PIO_S_PIO_IMR_P11_Pos                 _UINT32_(11)                                         /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Position */
#define PIO_S_PIO_IMR_P11_Msk                 (_UINT32_(0x1) << PIO_S_PIO_IMR_P11_Pos)             /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Mask */
#define PIO_S_PIO_IMR_P11(value)              (PIO_S_PIO_IMR_P11_Msk & (_UINT32_(value) << PIO_S_PIO_IMR_P11_Pos)) /* Assigment of value for P11 in the PIO_S_PIO_IMR register */
#define PIO_S_PIO_IMR_P12_Pos                 _UINT32_(12)                                         /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Position */
#define PIO_S_PIO_IMR_P12_Msk                 (_UINT32_(0x1) << PIO_S_PIO_IMR_P12_Pos)             /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Mask */
#define PIO_S_PIO_IMR_P12(value)              (PIO_S_PIO_IMR_P12_Msk & (_UINT32_(value) << PIO_S_PIO_IMR_P12_Pos)) /* Assigment of value for P12 in the PIO_S_PIO_IMR register */
#define PIO_S_PIO_IMR_P13_Pos                 _UINT32_(13)                                         /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Position */
#define PIO_S_PIO_IMR_P13_Msk                 (_UINT32_(0x1) << PIO_S_PIO_IMR_P13_Pos)             /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Mask */
#define PIO_S_PIO_IMR_P13(value)              (PIO_S_PIO_IMR_P13_Msk & (_UINT32_(value) << PIO_S_PIO_IMR_P13_Pos)) /* Assigment of value for P13 in the PIO_S_PIO_IMR register */
#define PIO_S_PIO_IMR_P14_Pos                 _UINT32_(14)                                         /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Position */
#define PIO_S_PIO_IMR_P14_Msk                 (_UINT32_(0x1) << PIO_S_PIO_IMR_P14_Pos)             /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Mask */
#define PIO_S_PIO_IMR_P14(value)              (PIO_S_PIO_IMR_P14_Msk & (_UINT32_(value) << PIO_S_PIO_IMR_P14_Pos)) /* Assigment of value for P14 in the PIO_S_PIO_IMR register */
#define PIO_S_PIO_IMR_P15_Pos                 _UINT32_(15)                                         /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Position */
#define PIO_S_PIO_IMR_P15_Msk                 (_UINT32_(0x1) << PIO_S_PIO_IMR_P15_Pos)             /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Mask */
#define PIO_S_PIO_IMR_P15(value)              (PIO_S_PIO_IMR_P15_Msk & (_UINT32_(value) << PIO_S_PIO_IMR_P15_Pos)) /* Assigment of value for P15 in the PIO_S_PIO_IMR register */
#define PIO_S_PIO_IMR_P16_Pos                 _UINT32_(16)                                         /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Position */
#define PIO_S_PIO_IMR_P16_Msk                 (_UINT32_(0x1) << PIO_S_PIO_IMR_P16_Pos)             /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Mask */
#define PIO_S_PIO_IMR_P16(value)              (PIO_S_PIO_IMR_P16_Msk & (_UINT32_(value) << PIO_S_PIO_IMR_P16_Pos)) /* Assigment of value for P16 in the PIO_S_PIO_IMR register */
#define PIO_S_PIO_IMR_P17_Pos                 _UINT32_(17)                                         /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Position */
#define PIO_S_PIO_IMR_P17_Msk                 (_UINT32_(0x1) << PIO_S_PIO_IMR_P17_Pos)             /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Mask */
#define PIO_S_PIO_IMR_P17(value)              (PIO_S_PIO_IMR_P17_Msk & (_UINT32_(value) << PIO_S_PIO_IMR_P17_Pos)) /* Assigment of value for P17 in the PIO_S_PIO_IMR register */
#define PIO_S_PIO_IMR_P18_Pos                 _UINT32_(18)                                         /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Position */
#define PIO_S_PIO_IMR_P18_Msk                 (_UINT32_(0x1) << PIO_S_PIO_IMR_P18_Pos)             /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Mask */
#define PIO_S_PIO_IMR_P18(value)              (PIO_S_PIO_IMR_P18_Msk & (_UINT32_(value) << PIO_S_PIO_IMR_P18_Pos)) /* Assigment of value for P18 in the PIO_S_PIO_IMR register */
#define PIO_S_PIO_IMR_P19_Pos                 _UINT32_(19)                                         /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Position */
#define PIO_S_PIO_IMR_P19_Msk                 (_UINT32_(0x1) << PIO_S_PIO_IMR_P19_Pos)             /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Mask */
#define PIO_S_PIO_IMR_P19(value)              (PIO_S_PIO_IMR_P19_Msk & (_UINT32_(value) << PIO_S_PIO_IMR_P19_Pos)) /* Assigment of value for P19 in the PIO_S_PIO_IMR register */
#define PIO_S_PIO_IMR_P20_Pos                 _UINT32_(20)                                         /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Position */
#define PIO_S_PIO_IMR_P20_Msk                 (_UINT32_(0x1) << PIO_S_PIO_IMR_P20_Pos)             /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Mask */
#define PIO_S_PIO_IMR_P20(value)              (PIO_S_PIO_IMR_P20_Msk & (_UINT32_(value) << PIO_S_PIO_IMR_P20_Pos)) /* Assigment of value for P20 in the PIO_S_PIO_IMR register */
#define PIO_S_PIO_IMR_P21_Pos                 _UINT32_(21)                                         /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Position */
#define PIO_S_PIO_IMR_P21_Msk                 (_UINT32_(0x1) << PIO_S_PIO_IMR_P21_Pos)             /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Mask */
#define PIO_S_PIO_IMR_P21(value)              (PIO_S_PIO_IMR_P21_Msk & (_UINT32_(value) << PIO_S_PIO_IMR_P21_Pos)) /* Assigment of value for P21 in the PIO_S_PIO_IMR register */
#define PIO_S_PIO_IMR_P22_Pos                 _UINT32_(22)                                         /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Position */
#define PIO_S_PIO_IMR_P22_Msk                 (_UINT32_(0x1) << PIO_S_PIO_IMR_P22_Pos)             /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Mask */
#define PIO_S_PIO_IMR_P22(value)              (PIO_S_PIO_IMR_P22_Msk & (_UINT32_(value) << PIO_S_PIO_IMR_P22_Pos)) /* Assigment of value for P22 in the PIO_S_PIO_IMR register */
#define PIO_S_PIO_IMR_P23_Pos                 _UINT32_(23)                                         /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Position */
#define PIO_S_PIO_IMR_P23_Msk                 (_UINT32_(0x1) << PIO_S_PIO_IMR_P23_Pos)             /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Mask */
#define PIO_S_PIO_IMR_P23(value)              (PIO_S_PIO_IMR_P23_Msk & (_UINT32_(value) << PIO_S_PIO_IMR_P23_Pos)) /* Assigment of value for P23 in the PIO_S_PIO_IMR register */
#define PIO_S_PIO_IMR_P24_Pos                 _UINT32_(24)                                         /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Position */
#define PIO_S_PIO_IMR_P24_Msk                 (_UINT32_(0x1) << PIO_S_PIO_IMR_P24_Pos)             /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Mask */
#define PIO_S_PIO_IMR_P24(value)              (PIO_S_PIO_IMR_P24_Msk & (_UINT32_(value) << PIO_S_PIO_IMR_P24_Pos)) /* Assigment of value for P24 in the PIO_S_PIO_IMR register */
#define PIO_S_PIO_IMR_P25_Pos                 _UINT32_(25)                                         /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Position */
#define PIO_S_PIO_IMR_P25_Msk                 (_UINT32_(0x1) << PIO_S_PIO_IMR_P25_Pos)             /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Mask */
#define PIO_S_PIO_IMR_P25(value)              (PIO_S_PIO_IMR_P25_Msk & (_UINT32_(value) << PIO_S_PIO_IMR_P25_Pos)) /* Assigment of value for P25 in the PIO_S_PIO_IMR register */
#define PIO_S_PIO_IMR_P26_Pos                 _UINT32_(26)                                         /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Position */
#define PIO_S_PIO_IMR_P26_Msk                 (_UINT32_(0x1) << PIO_S_PIO_IMR_P26_Pos)             /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Mask */
#define PIO_S_PIO_IMR_P26(value)              (PIO_S_PIO_IMR_P26_Msk & (_UINT32_(value) << PIO_S_PIO_IMR_P26_Pos)) /* Assigment of value for P26 in the PIO_S_PIO_IMR register */
#define PIO_S_PIO_IMR_P27_Pos                 _UINT32_(27)                                         /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Position */
#define PIO_S_PIO_IMR_P27_Msk                 (_UINT32_(0x1) << PIO_S_PIO_IMR_P27_Pos)             /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Mask */
#define PIO_S_PIO_IMR_P27(value)              (PIO_S_PIO_IMR_P27_Msk & (_UINT32_(value) << PIO_S_PIO_IMR_P27_Pos)) /* Assigment of value for P27 in the PIO_S_PIO_IMR register */
#define PIO_S_PIO_IMR_P28_Pos                 _UINT32_(28)                                         /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Position */
#define PIO_S_PIO_IMR_P28_Msk                 (_UINT32_(0x1) << PIO_S_PIO_IMR_P28_Pos)             /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Mask */
#define PIO_S_PIO_IMR_P28(value)              (PIO_S_PIO_IMR_P28_Msk & (_UINT32_(value) << PIO_S_PIO_IMR_P28_Pos)) /* Assigment of value for P28 in the PIO_S_PIO_IMR register */
#define PIO_S_PIO_IMR_P29_Pos                 _UINT32_(29)                                         /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Position */
#define PIO_S_PIO_IMR_P29_Msk                 (_UINT32_(0x1) << PIO_S_PIO_IMR_P29_Pos)             /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Mask */
#define PIO_S_PIO_IMR_P29(value)              (PIO_S_PIO_IMR_P29_Msk & (_UINT32_(value) << PIO_S_PIO_IMR_P29_Pos)) /* Assigment of value for P29 in the PIO_S_PIO_IMR register */
#define PIO_S_PIO_IMR_P30_Pos                 _UINT32_(30)                                         /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Position */
#define PIO_S_PIO_IMR_P30_Msk                 (_UINT32_(0x1) << PIO_S_PIO_IMR_P30_Pos)             /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Mask */
#define PIO_S_PIO_IMR_P30(value)              (PIO_S_PIO_IMR_P30_Msk & (_UINT32_(value) << PIO_S_PIO_IMR_P30_Pos)) /* Assigment of value for P30 in the PIO_S_PIO_IMR register */
#define PIO_S_PIO_IMR_P31_Pos                 _UINT32_(31)                                         /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Position */
#define PIO_S_PIO_IMR_P31_Msk                 (_UINT32_(0x1) << PIO_S_PIO_IMR_P31_Pos)             /* (PIO_S_PIO_IMR) Input Change Interrupt Mask Mask */
#define PIO_S_PIO_IMR_P31(value)              (PIO_S_PIO_IMR_P31_Msk & (_UINT32_(value) << PIO_S_PIO_IMR_P31_Pos)) /* Assigment of value for P31 in the PIO_S_PIO_IMR register */
#define PIO_S_PIO_IMR_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (PIO_S_PIO_IMR) Register Mask  */

#define PIO_S_PIO_IMR_P_Pos                   _UINT32_(0)                                          /* (PIO_S_PIO_IMR Position) Input Change Interrupt Mask */
#define PIO_S_PIO_IMR_P_Msk                   (_UINT32_(0xFFFFFFFF) << PIO_S_PIO_IMR_P_Pos)        /* (PIO_S_PIO_IMR Mask) P */
#define PIO_S_PIO_IMR_P(value)                (PIO_S_PIO_IMR_P_Msk & (_UINT32_(value) << PIO_S_PIO_IMR_P_Pos)) 

/* -------- PIO_S_PIO_IOFR : (PIO Offset: 0x3C) ( /W 32) Secure PIO I/O Freeze Configuration Register -------- */
#define PIO_S_PIO_IOFR_FPHY_Pos               _UINT32_(0)                                          /* (PIO_S_PIO_IOFR) Freeze Physical Configuration Position */
#define PIO_S_PIO_IOFR_FPHY_Msk               (_UINT32_(0x1) << PIO_S_PIO_IOFR_FPHY_Pos)           /* (PIO_S_PIO_IOFR) Freeze Physical Configuration Mask */
#define PIO_S_PIO_IOFR_FPHY(value)            (PIO_S_PIO_IOFR_FPHY_Msk & (_UINT32_(value) << PIO_S_PIO_IOFR_FPHY_Pos)) /* Assigment of value for FPHY in the PIO_S_PIO_IOFR register */
#define PIO_S_PIO_IOFR_FINT_Pos               _UINT32_(1)                                          /* (PIO_S_PIO_IOFR) Freeze Interrupt Configuration Position */
#define PIO_S_PIO_IOFR_FINT_Msk               (_UINT32_(0x1) << PIO_S_PIO_IOFR_FINT_Pos)           /* (PIO_S_PIO_IOFR) Freeze Interrupt Configuration Mask */
#define PIO_S_PIO_IOFR_FINT(value)            (PIO_S_PIO_IOFR_FINT_Msk & (_UINT32_(value) << PIO_S_PIO_IOFR_FINT_Pos)) /* Assigment of value for FINT in the PIO_S_PIO_IOFR register */
#define PIO_S_PIO_IOFR_FRZKEY_Pos             _UINT32_(8)                                          /* (PIO_S_PIO_IOFR) Freeze Key Position */
#define PIO_S_PIO_IOFR_FRZKEY_Msk             (_UINT32_(0xFFFFFF) << PIO_S_PIO_IOFR_FRZKEY_Pos)    /* (PIO_S_PIO_IOFR) Freeze Key Mask */
#define PIO_S_PIO_IOFR_FRZKEY(value)          (PIO_S_PIO_IOFR_FRZKEY_Msk & (_UINT32_(value) << PIO_S_PIO_IOFR_FRZKEY_Pos)) /* Assigment of value for FRZKEY in the PIO_S_PIO_IOFR register */
#define   PIO_S_PIO_IOFR_FRZKEY_PASSWD_Val    _UINT32_(0x494F46)                                   /* (PIO_S_PIO_IOFR) Writing any other value in this field aborts the write operation of the WPEN bit.  */
#define PIO_S_PIO_IOFR_FRZKEY_PASSWD          (PIO_S_PIO_IOFR_FRZKEY_PASSWD_Val << PIO_S_PIO_IOFR_FRZKEY_Pos) /* (PIO_S_PIO_IOFR) Writing any other value in this field aborts the write operation of the WPEN bit. Position  */
#define PIO_S_PIO_IOFR_Msk                    _UINT32_(0xFFFFFF03)                                 /* (PIO_S_PIO_IOFR) Register Mask  */


