Microchip-MPLAB-Harmony/csp_apps_sam_a5d2/apps/mcan/mcan_fd_operation_blocking/firmware/src/packs/ATSAMA5D29_DFP/component/pio.h
/* -------- PIO_S_PIO_IOSSR : (PIO Offset: 0x38) ( R/ 32) Secure PIO I/O Security Status Register -------- */
#define PIO_S_PIO_IOSSR_P0_Pos                _UINT32_(0)                                          /* (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P0_Msk                (_UINT32_(0x1) << PIO_S_PIO_IOSSR_P0_Pos)            /* (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P0(value)             (PIO_S_PIO_IOSSR_P0_Msk & (_UINT32_(value) << PIO_S_PIO_IOSSR_P0_Pos)) /* Assigment of value for P0 in the PIO_S_PIO_IOSSR register */
#define   PIO_S_PIO_IOSSR_P0_SECURE_Val       _UINT32_(0x0)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P0_NON_SECURE_Val   _UINT32_(0x1)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P0_SECURE             (PIO_S_PIO_IOSSR_P0_SECURE_Val << PIO_S_PIO_IOSSR_P0_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P0_NON_SECURE         (PIO_S_PIO_IOSSR_P0_NON_SECURE_Val << PIO_S_PIO_IOSSR_P0_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P1_Pos                _UINT32_(1)                                          /* (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P1_Msk                (_UINT32_(0x1) << PIO_S_PIO_IOSSR_P1_Pos)            /* (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P1(value)             (PIO_S_PIO_IOSSR_P1_Msk & (_UINT32_(value) << PIO_S_PIO_IOSSR_P1_Pos)) /* Assigment of value for P1 in the PIO_S_PIO_IOSSR register */
#define   PIO_S_PIO_IOSSR_P1_SECURE_Val       _UINT32_(0x0)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P1_NON_SECURE_Val   _UINT32_(0x1)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P1_SECURE             (PIO_S_PIO_IOSSR_P1_SECURE_Val << PIO_S_PIO_IOSSR_P1_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P1_NON_SECURE         (PIO_S_PIO_IOSSR_P1_NON_SECURE_Val << PIO_S_PIO_IOSSR_P1_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P2_Pos                _UINT32_(2)                                          /* (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P2_Msk                (_UINT32_(0x1) << PIO_S_PIO_IOSSR_P2_Pos)            /* (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P2(value)             (PIO_S_PIO_IOSSR_P2_Msk & (_UINT32_(value) << PIO_S_PIO_IOSSR_P2_Pos)) /* Assigment of value for P2 in the PIO_S_PIO_IOSSR register */
#define   PIO_S_PIO_IOSSR_P2_SECURE_Val       _UINT32_(0x0)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P2_NON_SECURE_Val   _UINT32_(0x1)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P2_SECURE             (PIO_S_PIO_IOSSR_P2_SECURE_Val << PIO_S_PIO_IOSSR_P2_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P2_NON_SECURE         (PIO_S_PIO_IOSSR_P2_NON_SECURE_Val << PIO_S_PIO_IOSSR_P2_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P3_Pos                _UINT32_(3)                                          /* (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P3_Msk                (_UINT32_(0x1) << PIO_S_PIO_IOSSR_P3_Pos)            /* (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P3(value)             (PIO_S_PIO_IOSSR_P3_Msk & (_UINT32_(value) << PIO_S_PIO_IOSSR_P3_Pos)) /* Assigment of value for P3 in the PIO_S_PIO_IOSSR register */
#define   PIO_S_PIO_IOSSR_P3_SECURE_Val       _UINT32_(0x0)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P3_NON_SECURE_Val   _UINT32_(0x1)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P3_SECURE             (PIO_S_PIO_IOSSR_P3_SECURE_Val << PIO_S_PIO_IOSSR_P3_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P3_NON_SECURE         (PIO_S_PIO_IOSSR_P3_NON_SECURE_Val << PIO_S_PIO_IOSSR_P3_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P4_Pos                _UINT32_(4)                                          /* (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P4_Msk                (_UINT32_(0x1) << PIO_S_PIO_IOSSR_P4_Pos)            /* (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P4(value)             (PIO_S_PIO_IOSSR_P4_Msk & (_UINT32_(value) << PIO_S_PIO_IOSSR_P4_Pos)) /* Assigment of value for P4 in the PIO_S_PIO_IOSSR register */
#define   PIO_S_PIO_IOSSR_P4_SECURE_Val       _UINT32_(0x0)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P4_NON_SECURE_Val   _UINT32_(0x1)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P4_SECURE             (PIO_S_PIO_IOSSR_P4_SECURE_Val << PIO_S_PIO_IOSSR_P4_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P4_NON_SECURE         (PIO_S_PIO_IOSSR_P4_NON_SECURE_Val << PIO_S_PIO_IOSSR_P4_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P5_Pos                _UINT32_(5)                                          /* (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P5_Msk                (_UINT32_(0x1) << PIO_S_PIO_IOSSR_P5_Pos)            /* (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P5(value)             (PIO_S_PIO_IOSSR_P5_Msk & (_UINT32_(value) << PIO_S_PIO_IOSSR_P5_Pos)) /* Assigment of value for P5 in the PIO_S_PIO_IOSSR register */
#define   PIO_S_PIO_IOSSR_P5_SECURE_Val       _UINT32_(0x0)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P5_NON_SECURE_Val   _UINT32_(0x1)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P5_SECURE             (PIO_S_PIO_IOSSR_P5_SECURE_Val << PIO_S_PIO_IOSSR_P5_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P5_NON_SECURE         (PIO_S_PIO_IOSSR_P5_NON_SECURE_Val << PIO_S_PIO_IOSSR_P5_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P6_Pos                _UINT32_(6)                                          /* (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P6_Msk                (_UINT32_(0x1) << PIO_S_PIO_IOSSR_P6_Pos)            /* (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P6(value)             (PIO_S_PIO_IOSSR_P6_Msk & (_UINT32_(value) << PIO_S_PIO_IOSSR_P6_Pos)) /* Assigment of value for P6 in the PIO_S_PIO_IOSSR register */
#define   PIO_S_PIO_IOSSR_P6_SECURE_Val       _UINT32_(0x0)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P6_NON_SECURE_Val   _UINT32_(0x1)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P6_SECURE             (PIO_S_PIO_IOSSR_P6_SECURE_Val << PIO_S_PIO_IOSSR_P6_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P6_NON_SECURE         (PIO_S_PIO_IOSSR_P6_NON_SECURE_Val << PIO_S_PIO_IOSSR_P6_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P7_Pos                _UINT32_(7)                                          /* (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P7_Msk                (_UINT32_(0x1) << PIO_S_PIO_IOSSR_P7_Pos)            /* (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P7(value)             (PIO_S_PIO_IOSSR_P7_Msk & (_UINT32_(value) << PIO_S_PIO_IOSSR_P7_Pos)) /* Assigment of value for P7 in the PIO_S_PIO_IOSSR register */
#define   PIO_S_PIO_IOSSR_P7_SECURE_Val       _UINT32_(0x0)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P7_NON_SECURE_Val   _UINT32_(0x1)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P7_SECURE             (PIO_S_PIO_IOSSR_P7_SECURE_Val << PIO_S_PIO_IOSSR_P7_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P7_NON_SECURE         (PIO_S_PIO_IOSSR_P7_NON_SECURE_Val << PIO_S_PIO_IOSSR_P7_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P8_Pos                _UINT32_(8)                                          /* (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P8_Msk                (_UINT32_(0x1) << PIO_S_PIO_IOSSR_P8_Pos)            /* (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P8(value)             (PIO_S_PIO_IOSSR_P8_Msk & (_UINT32_(value) << PIO_S_PIO_IOSSR_P8_Pos)) /* Assigment of value for P8 in the PIO_S_PIO_IOSSR register */
#define   PIO_S_PIO_IOSSR_P8_SECURE_Val       _UINT32_(0x0)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P8_NON_SECURE_Val   _UINT32_(0x1)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P8_SECURE             (PIO_S_PIO_IOSSR_P8_SECURE_Val << PIO_S_PIO_IOSSR_P8_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P8_NON_SECURE         (PIO_S_PIO_IOSSR_P8_NON_SECURE_Val << PIO_S_PIO_IOSSR_P8_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P9_Pos                _UINT32_(9)                                          /* (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P9_Msk                (_UINT32_(0x1) << PIO_S_PIO_IOSSR_P9_Pos)            /* (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P9(value)             (PIO_S_PIO_IOSSR_P9_Msk & (_UINT32_(value) << PIO_S_PIO_IOSSR_P9_Pos)) /* Assigment of value for P9 in the PIO_S_PIO_IOSSR register */
#define   PIO_S_PIO_IOSSR_P9_SECURE_Val       _UINT32_(0x0)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P9_NON_SECURE_Val   _UINT32_(0x1)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P9_SECURE             (PIO_S_PIO_IOSSR_P9_SECURE_Val << PIO_S_PIO_IOSSR_P9_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P9_NON_SECURE         (PIO_S_PIO_IOSSR_P9_NON_SECURE_Val << PIO_S_PIO_IOSSR_P9_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P10_Pos               _UINT32_(10)                                         /* (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P10_Msk               (_UINT32_(0x1) << PIO_S_PIO_IOSSR_P10_Pos)           /* (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P10(value)            (PIO_S_PIO_IOSSR_P10_Msk & (_UINT32_(value) << PIO_S_PIO_IOSSR_P10_Pos)) /* Assigment of value for P10 in the PIO_S_PIO_IOSSR register */
#define   PIO_S_PIO_IOSSR_P10_SECURE_Val      _UINT32_(0x0)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P10_NON_SECURE_Val  _UINT32_(0x1)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P10_SECURE            (PIO_S_PIO_IOSSR_P10_SECURE_Val << PIO_S_PIO_IOSSR_P10_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P10_NON_SECURE        (PIO_S_PIO_IOSSR_P10_NON_SECURE_Val << PIO_S_PIO_IOSSR_P10_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P11_Pos               _UINT32_(11)                                         /* (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P11_Msk               (_UINT32_(0x1) << PIO_S_PIO_IOSSR_P11_Pos)           /* (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P11(value)            (PIO_S_PIO_IOSSR_P11_Msk & (_UINT32_(value) << PIO_S_PIO_IOSSR_P11_Pos)) /* Assigment of value for P11 in the PIO_S_PIO_IOSSR register */
#define   PIO_S_PIO_IOSSR_P11_SECURE_Val      _UINT32_(0x0)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P11_NON_SECURE_Val  _UINT32_(0x1)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P11_SECURE            (PIO_S_PIO_IOSSR_P11_SECURE_Val << PIO_S_PIO_IOSSR_P11_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P11_NON_SECURE        (PIO_S_PIO_IOSSR_P11_NON_SECURE_Val << PIO_S_PIO_IOSSR_P11_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P12_Pos               _UINT32_(12)                                         /* (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P12_Msk               (_UINT32_(0x1) << PIO_S_PIO_IOSSR_P12_Pos)           /* (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P12(value)            (PIO_S_PIO_IOSSR_P12_Msk & (_UINT32_(value) << PIO_S_PIO_IOSSR_P12_Pos)) /* Assigment of value for P12 in the PIO_S_PIO_IOSSR register */
#define   PIO_S_PIO_IOSSR_P12_SECURE_Val      _UINT32_(0x0)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P12_NON_SECURE_Val  _UINT32_(0x1)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P12_SECURE            (PIO_S_PIO_IOSSR_P12_SECURE_Val << PIO_S_PIO_IOSSR_P12_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P12_NON_SECURE        (PIO_S_PIO_IOSSR_P12_NON_SECURE_Val << PIO_S_PIO_IOSSR_P12_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P13_Pos               _UINT32_(13)                                         /* (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P13_Msk               (_UINT32_(0x1) << PIO_S_PIO_IOSSR_P13_Pos)           /* (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P13(value)            (PIO_S_PIO_IOSSR_P13_Msk & (_UINT32_(value) << PIO_S_PIO_IOSSR_P13_Pos)) /* Assigment of value for P13 in the PIO_S_PIO_IOSSR register */
#define   PIO_S_PIO_IOSSR_P13_SECURE_Val      _UINT32_(0x0)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P13_NON_SECURE_Val  _UINT32_(0x1)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P13_SECURE            (PIO_S_PIO_IOSSR_P13_SECURE_Val << PIO_S_PIO_IOSSR_P13_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P13_NON_SECURE        (PIO_S_PIO_IOSSR_P13_NON_SECURE_Val << PIO_S_PIO_IOSSR_P13_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P14_Pos               _UINT32_(14)                                         /* (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P14_Msk               (_UINT32_(0x1) << PIO_S_PIO_IOSSR_P14_Pos)           /* (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P14(value)            (PIO_S_PIO_IOSSR_P14_Msk & (_UINT32_(value) << PIO_S_PIO_IOSSR_P14_Pos)) /* Assigment of value for P14 in the PIO_S_PIO_IOSSR register */
#define   PIO_S_PIO_IOSSR_P14_SECURE_Val      _UINT32_(0x0)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P14_NON_SECURE_Val  _UINT32_(0x1)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P14_SECURE            (PIO_S_PIO_IOSSR_P14_SECURE_Val << PIO_S_PIO_IOSSR_P14_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P14_NON_SECURE        (PIO_S_PIO_IOSSR_P14_NON_SECURE_Val << PIO_S_PIO_IOSSR_P14_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P15_Pos               _UINT32_(15)                                         /* (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P15_Msk               (_UINT32_(0x1) << PIO_S_PIO_IOSSR_P15_Pos)           /* (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P15(value)            (PIO_S_PIO_IOSSR_P15_Msk & (_UINT32_(value) << PIO_S_PIO_IOSSR_P15_Pos)) /* Assigment of value for P15 in the PIO_S_PIO_IOSSR register */
#define   PIO_S_PIO_IOSSR_P15_SECURE_Val      _UINT32_(0x0)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P15_NON_SECURE_Val  _UINT32_(0x1)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P15_SECURE            (PIO_S_PIO_IOSSR_P15_SECURE_Val << PIO_S_PIO_IOSSR_P15_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P15_NON_SECURE        (PIO_S_PIO_IOSSR_P15_NON_SECURE_Val << PIO_S_PIO_IOSSR_P15_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P16_Pos               _UINT32_(16)                                         /* (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P16_Msk               (_UINT32_(0x1) << PIO_S_PIO_IOSSR_P16_Pos)           /* (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P16(value)            (PIO_S_PIO_IOSSR_P16_Msk & (_UINT32_(value) << PIO_S_PIO_IOSSR_P16_Pos)) /* Assigment of value for P16 in the PIO_S_PIO_IOSSR register */
#define   PIO_S_PIO_IOSSR_P16_SECURE_Val      _UINT32_(0x0)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P16_NON_SECURE_Val  _UINT32_(0x1)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P16_SECURE            (PIO_S_PIO_IOSSR_P16_SECURE_Val << PIO_S_PIO_IOSSR_P16_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P16_NON_SECURE        (PIO_S_PIO_IOSSR_P16_NON_SECURE_Val << PIO_S_PIO_IOSSR_P16_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P17_Pos               _UINT32_(17)                                         /* (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P17_Msk               (_UINT32_(0x1) << PIO_S_PIO_IOSSR_P17_Pos)           /* (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P17(value)            (PIO_S_PIO_IOSSR_P17_Msk & (_UINT32_(value) << PIO_S_PIO_IOSSR_P17_Pos)) /* Assigment of value for P17 in the PIO_S_PIO_IOSSR register */
#define   PIO_S_PIO_IOSSR_P17_SECURE_Val      _UINT32_(0x0)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P17_NON_SECURE_Val  _UINT32_(0x1)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P17_SECURE            (PIO_S_PIO_IOSSR_P17_SECURE_Val << PIO_S_PIO_IOSSR_P17_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P17_NON_SECURE        (PIO_S_PIO_IOSSR_P17_NON_SECURE_Val << PIO_S_PIO_IOSSR_P17_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P18_Pos               _UINT32_(18)                                         /* (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P18_Msk               (_UINT32_(0x1) << PIO_S_PIO_IOSSR_P18_Pos)           /* (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P18(value)            (PIO_S_PIO_IOSSR_P18_Msk & (_UINT32_(value) << PIO_S_PIO_IOSSR_P18_Pos)) /* Assigment of value for P18 in the PIO_S_PIO_IOSSR register */
#define   PIO_S_PIO_IOSSR_P18_SECURE_Val      _UINT32_(0x0)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P18_NON_SECURE_Val  _UINT32_(0x1)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P18_SECURE            (PIO_S_PIO_IOSSR_P18_SECURE_Val << PIO_S_PIO_IOSSR_P18_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P18_NON_SECURE        (PIO_S_PIO_IOSSR_P18_NON_SECURE_Val << PIO_S_PIO_IOSSR_P18_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P19_Pos               _UINT32_(19)                                         /* (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P19_Msk               (_UINT32_(0x1) << PIO_S_PIO_IOSSR_P19_Pos)           /* (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P19(value)            (PIO_S_PIO_IOSSR_P19_Msk & (_UINT32_(value) << PIO_S_PIO_IOSSR_P19_Pos)) /* Assigment of value for P19 in the PIO_S_PIO_IOSSR register */
