Microchip-MPLAB-Harmony/csp_apps_sam_a5d2/apps/mcan/mcan_fd_operation_blocking/firmware/src/packs/ATSAMA5D29_DFP/component/pio.h
#define   PIO_S_PIO_IOSSR_P19_SECURE_Val      _UINT32_(0x0)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P19_NON_SECURE_Val  _UINT32_(0x1)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P19_SECURE            (PIO_S_PIO_IOSSR_P19_SECURE_Val << PIO_S_PIO_IOSSR_P19_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P19_NON_SECURE        (PIO_S_PIO_IOSSR_P19_NON_SECURE_Val << PIO_S_PIO_IOSSR_P19_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P20_Pos               _UINT32_(20)                                         /* (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P20_Msk               (_UINT32_(0x1) << PIO_S_PIO_IOSSR_P20_Pos)           /* (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P20(value)            (PIO_S_PIO_IOSSR_P20_Msk & (_UINT32_(value) << PIO_S_PIO_IOSSR_P20_Pos)) /* Assigment of value for P20 in the PIO_S_PIO_IOSSR register */
#define   PIO_S_PIO_IOSSR_P20_SECURE_Val      _UINT32_(0x0)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P20_NON_SECURE_Val  _UINT32_(0x1)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P20_SECURE            (PIO_S_PIO_IOSSR_P20_SECURE_Val << PIO_S_PIO_IOSSR_P20_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P20_NON_SECURE        (PIO_S_PIO_IOSSR_P20_NON_SECURE_Val << PIO_S_PIO_IOSSR_P20_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P21_Pos               _UINT32_(21)                                         /* (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P21_Msk               (_UINT32_(0x1) << PIO_S_PIO_IOSSR_P21_Pos)           /* (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P21(value)            (PIO_S_PIO_IOSSR_P21_Msk & (_UINT32_(value) << PIO_S_PIO_IOSSR_P21_Pos)) /* Assigment of value for P21 in the PIO_S_PIO_IOSSR register */
#define   PIO_S_PIO_IOSSR_P21_SECURE_Val      _UINT32_(0x0)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P21_NON_SECURE_Val  _UINT32_(0x1)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P21_SECURE            (PIO_S_PIO_IOSSR_P21_SECURE_Val << PIO_S_PIO_IOSSR_P21_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P21_NON_SECURE        (PIO_S_PIO_IOSSR_P21_NON_SECURE_Val << PIO_S_PIO_IOSSR_P21_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P22_Pos               _UINT32_(22)                                         /* (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P22_Msk               (_UINT32_(0x1) << PIO_S_PIO_IOSSR_P22_Pos)           /* (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P22(value)            (PIO_S_PIO_IOSSR_P22_Msk & (_UINT32_(value) << PIO_S_PIO_IOSSR_P22_Pos)) /* Assigment of value for P22 in the PIO_S_PIO_IOSSR register */
#define   PIO_S_PIO_IOSSR_P22_SECURE_Val      _UINT32_(0x0)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P22_NON_SECURE_Val  _UINT32_(0x1)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P22_SECURE            (PIO_S_PIO_IOSSR_P22_SECURE_Val << PIO_S_PIO_IOSSR_P22_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P22_NON_SECURE        (PIO_S_PIO_IOSSR_P22_NON_SECURE_Val << PIO_S_PIO_IOSSR_P22_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P23_Pos               _UINT32_(23)                                         /* (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P23_Msk               (_UINT32_(0x1) << PIO_S_PIO_IOSSR_P23_Pos)           /* (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P23(value)            (PIO_S_PIO_IOSSR_P23_Msk & (_UINT32_(value) << PIO_S_PIO_IOSSR_P23_Pos)) /* Assigment of value for P23 in the PIO_S_PIO_IOSSR register */
#define   PIO_S_PIO_IOSSR_P23_SECURE_Val      _UINT32_(0x0)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P23_NON_SECURE_Val  _UINT32_(0x1)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P23_SECURE            (PIO_S_PIO_IOSSR_P23_SECURE_Val << PIO_S_PIO_IOSSR_P23_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P23_NON_SECURE        (PIO_S_PIO_IOSSR_P23_NON_SECURE_Val << PIO_S_PIO_IOSSR_P23_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P24_Pos               _UINT32_(24)                                         /* (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P24_Msk               (_UINT32_(0x1) << PIO_S_PIO_IOSSR_P24_Pos)           /* (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P24(value)            (PIO_S_PIO_IOSSR_P24_Msk & (_UINT32_(value) << PIO_S_PIO_IOSSR_P24_Pos)) /* Assigment of value for P24 in the PIO_S_PIO_IOSSR register */
#define   PIO_S_PIO_IOSSR_P24_SECURE_Val      _UINT32_(0x0)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P24_NON_SECURE_Val  _UINT32_(0x1)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P24_SECURE            (PIO_S_PIO_IOSSR_P24_SECURE_Val << PIO_S_PIO_IOSSR_P24_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P24_NON_SECURE        (PIO_S_PIO_IOSSR_P24_NON_SECURE_Val << PIO_S_PIO_IOSSR_P24_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P25_Pos               _UINT32_(25)                                         /* (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P25_Msk               (_UINT32_(0x1) << PIO_S_PIO_IOSSR_P25_Pos)           /* (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P25(value)            (PIO_S_PIO_IOSSR_P25_Msk & (_UINT32_(value) << PIO_S_PIO_IOSSR_P25_Pos)) /* Assigment of value for P25 in the PIO_S_PIO_IOSSR register */
#define   PIO_S_PIO_IOSSR_P25_SECURE_Val      _UINT32_(0x0)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P25_NON_SECURE_Val  _UINT32_(0x1)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P25_SECURE            (PIO_S_PIO_IOSSR_P25_SECURE_Val << PIO_S_PIO_IOSSR_P25_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P25_NON_SECURE        (PIO_S_PIO_IOSSR_P25_NON_SECURE_Val << PIO_S_PIO_IOSSR_P25_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P26_Pos               _UINT32_(26)                                         /* (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P26_Msk               (_UINT32_(0x1) << PIO_S_PIO_IOSSR_P26_Pos)           /* (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P26(value)            (PIO_S_PIO_IOSSR_P26_Msk & (_UINT32_(value) << PIO_S_PIO_IOSSR_P26_Pos)) /* Assigment of value for P26 in the PIO_S_PIO_IOSSR register */
#define   PIO_S_PIO_IOSSR_P26_SECURE_Val      _UINT32_(0x0)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P26_NON_SECURE_Val  _UINT32_(0x1)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P26_SECURE            (PIO_S_PIO_IOSSR_P26_SECURE_Val << PIO_S_PIO_IOSSR_P26_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P26_NON_SECURE        (PIO_S_PIO_IOSSR_P26_NON_SECURE_Val << PIO_S_PIO_IOSSR_P26_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P27_Pos               _UINT32_(27)                                         /* (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P27_Msk               (_UINT32_(0x1) << PIO_S_PIO_IOSSR_P27_Pos)           /* (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P27(value)            (PIO_S_PIO_IOSSR_P27_Msk & (_UINT32_(value) << PIO_S_PIO_IOSSR_P27_Pos)) /* Assigment of value for P27 in the PIO_S_PIO_IOSSR register */
#define   PIO_S_PIO_IOSSR_P27_SECURE_Val      _UINT32_(0x0)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P27_NON_SECURE_Val  _UINT32_(0x1)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P27_SECURE            (PIO_S_PIO_IOSSR_P27_SECURE_Val << PIO_S_PIO_IOSSR_P27_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P27_NON_SECURE        (PIO_S_PIO_IOSSR_P27_NON_SECURE_Val << PIO_S_PIO_IOSSR_P27_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P28_Pos               _UINT32_(28)                                         /* (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P28_Msk               (_UINT32_(0x1) << PIO_S_PIO_IOSSR_P28_Pos)           /* (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P28(value)            (PIO_S_PIO_IOSSR_P28_Msk & (_UINT32_(value) << PIO_S_PIO_IOSSR_P28_Pos)) /* Assigment of value for P28 in the PIO_S_PIO_IOSSR register */
#define   PIO_S_PIO_IOSSR_P28_SECURE_Val      _UINT32_(0x0)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P28_NON_SECURE_Val  _UINT32_(0x1)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P28_SECURE            (PIO_S_PIO_IOSSR_P28_SECURE_Val << PIO_S_PIO_IOSSR_P28_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P28_NON_SECURE        (PIO_S_PIO_IOSSR_P28_NON_SECURE_Val << PIO_S_PIO_IOSSR_P28_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P29_Pos               _UINT32_(29)                                         /* (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P29_Msk               (_UINT32_(0x1) << PIO_S_PIO_IOSSR_P29_Pos)           /* (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P29(value)            (PIO_S_PIO_IOSSR_P29_Msk & (_UINT32_(value) << PIO_S_PIO_IOSSR_P29_Pos)) /* Assigment of value for P29 in the PIO_S_PIO_IOSSR register */
#define   PIO_S_PIO_IOSSR_P29_SECURE_Val      _UINT32_(0x0)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P29_NON_SECURE_Val  _UINT32_(0x1)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P29_SECURE            (PIO_S_PIO_IOSSR_P29_SECURE_Val << PIO_S_PIO_IOSSR_P29_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P29_NON_SECURE        (PIO_S_PIO_IOSSR_P29_NON_SECURE_Val << PIO_S_PIO_IOSSR_P29_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P30_Pos               _UINT32_(30)                                         /* (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P30_Msk               (_UINT32_(0x1) << PIO_S_PIO_IOSSR_P30_Pos)           /* (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P30(value)            (PIO_S_PIO_IOSSR_P30_Msk & (_UINT32_(value) << PIO_S_PIO_IOSSR_P30_Pos)) /* Assigment of value for P30 in the PIO_S_PIO_IOSSR register */
#define   PIO_S_PIO_IOSSR_P30_SECURE_Val      _UINT32_(0x0)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P30_NON_SECURE_Val  _UINT32_(0x1)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P30_SECURE            (PIO_S_PIO_IOSSR_P30_SECURE_Val << PIO_S_PIO_IOSSR_P30_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P30_NON_SECURE        (PIO_S_PIO_IOSSR_P30_NON_SECURE_Val << PIO_S_PIO_IOSSR_P30_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P31_Pos               _UINT32_(31)                                         /* (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P31_Msk               (_UINT32_(0x1) << PIO_S_PIO_IOSSR_P31_Pos)           /* (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P31(value)            (PIO_S_PIO_IOSSR_P31_Msk & (_UINT32_(value) << PIO_S_PIO_IOSSR_P31_Pos)) /* Assigment of value for P31 in the PIO_S_PIO_IOSSR register */
#define   PIO_S_PIO_IOSSR_P31_SECURE_Val      _UINT32_(0x0)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P31_NON_SECURE_Val  _UINT32_(0x1)                                        /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P31_SECURE            (PIO_S_PIO_IOSSR_P31_SECURE_Val << PIO_S_PIO_IOSSR_P31_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P31_NON_SECURE        (PIO_S_PIO_IOSSR_P31_NON_SECURE_Val << PIO_S_PIO_IOSSR_P31_Pos) /* (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_Msk                   _UINT32_(0xFFFFFFFF)                                 /* (PIO_S_PIO_IOSSR) Register Mask  */

#define PIO_S_PIO_IOSSR_P_Pos                 _UINT32_(0)                                          /* (PIO_S_PIO_IOSSR Position) I/O Security Status */
#define PIO_S_PIO_IOSSR_P_Msk                 (_UINT32_(0xFFFFFFFF) << PIO_S_PIO_IOSSR_P_Pos)      /* (PIO_S_PIO_IOSSR Mask) P */
#define PIO_S_PIO_IOSSR_P(value)              (PIO_S_PIO_IOSSR_P_Msk & (_UINT32_(value) << PIO_S_PIO_IOSSR_P_Pos)) 

