Microchip-MPLAB-Harmony/csp_apps_sam_a5d2/apps/mcan/mcan_fd_operation_blocking/firmware/src/packs/ATSAMA5D29_DFP/component/pio.h
/* -------- PIO_S_PIO_MSKR : (PIO Offset: 0x00) (R/W 32) Secure PIO Mask Register -------- */
#define PIO_S_PIO_MSKR_MSK0_Pos               _UINT32_(0)                                          /* (PIO_S_PIO_MSKR) PIO Line 0 Mask Position */
#define PIO_S_PIO_MSKR_MSK0_Msk               (_UINT32_(0x1) << PIO_S_PIO_MSKR_MSK0_Pos)           /* (PIO_S_PIO_MSKR) PIO Line 0 Mask Mask */
#define PIO_S_PIO_MSKR_MSK0(value)            (PIO_S_PIO_MSKR_MSK0_Msk & (_UINT32_(value) << PIO_S_PIO_MSKR_MSK0_Pos)) /* Assigment of value for MSK0 in the PIO_S_PIO_MSKR register */
#define   PIO_S_PIO_MSKR_MSK0_DISABLED_Val    _UINT32_(0x0)                                        /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRx does not affect the corresponding I/O line configuration.  */
#define   PIO_S_PIO_MSKR_MSK0_ENABLED_Val     _UINT32_(0x1)                                        /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRX updates the corresponding I/O line configuration.  */
#define PIO_S_PIO_MSKR_MSK0_DISABLED          (PIO_S_PIO_MSKR_MSK0_DISABLED_Val << PIO_S_PIO_MSKR_MSK0_Pos) /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRx does not affect the corresponding I/O line configuration. Position  */
#define PIO_S_PIO_MSKR_MSK0_ENABLED           (PIO_S_PIO_MSKR_MSK0_ENABLED_Val << PIO_S_PIO_MSKR_MSK0_Pos) /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRX updates the corresponding I/O line configuration. Position  */
#define PIO_S_PIO_MSKR_MSK1_Pos               _UINT32_(1)                                          /* (PIO_S_PIO_MSKR) PIO Line 1 Mask Position */
#define PIO_S_PIO_MSKR_MSK1_Msk               (_UINT32_(0x1) << PIO_S_PIO_MSKR_MSK1_Pos)           /* (PIO_S_PIO_MSKR) PIO Line 1 Mask Mask */
#define PIO_S_PIO_MSKR_MSK1(value)            (PIO_S_PIO_MSKR_MSK1_Msk & (_UINT32_(value) << PIO_S_PIO_MSKR_MSK1_Pos)) /* Assigment of value for MSK1 in the PIO_S_PIO_MSKR register */
#define   PIO_S_PIO_MSKR_MSK1_DISABLED_Val    _UINT32_(0x0)                                        /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRx does not affect the corresponding I/O line configuration.  */
#define   PIO_S_PIO_MSKR_MSK1_ENABLED_Val     _UINT32_(0x1)                                        /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRX updates the corresponding I/O line configuration.  */
#define PIO_S_PIO_MSKR_MSK1_DISABLED          (PIO_S_PIO_MSKR_MSK1_DISABLED_Val << PIO_S_PIO_MSKR_MSK1_Pos) /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRx does not affect the corresponding I/O line configuration. Position  */
#define PIO_S_PIO_MSKR_MSK1_ENABLED           (PIO_S_PIO_MSKR_MSK1_ENABLED_Val << PIO_S_PIO_MSKR_MSK1_Pos) /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRX updates the corresponding I/O line configuration. Position  */
#define PIO_S_PIO_MSKR_MSK2_Pos               _UINT32_(2)                                          /* (PIO_S_PIO_MSKR) PIO Line 2 Mask Position */
#define PIO_S_PIO_MSKR_MSK2_Msk               (_UINT32_(0x1) << PIO_S_PIO_MSKR_MSK2_Pos)           /* (PIO_S_PIO_MSKR) PIO Line 2 Mask Mask */
#define PIO_S_PIO_MSKR_MSK2(value)            (PIO_S_PIO_MSKR_MSK2_Msk & (_UINT32_(value) << PIO_S_PIO_MSKR_MSK2_Pos)) /* Assigment of value for MSK2 in the PIO_S_PIO_MSKR register */
#define   PIO_S_PIO_MSKR_MSK2_DISABLED_Val    _UINT32_(0x0)                                        /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRx does not affect the corresponding I/O line configuration.  */
#define   PIO_S_PIO_MSKR_MSK2_ENABLED_Val     _UINT32_(0x1)                                        /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRX updates the corresponding I/O line configuration.  */
#define PIO_S_PIO_MSKR_MSK2_DISABLED          (PIO_S_PIO_MSKR_MSK2_DISABLED_Val << PIO_S_PIO_MSKR_MSK2_Pos) /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRx does not affect the corresponding I/O line configuration. Position  */
#define PIO_S_PIO_MSKR_MSK2_ENABLED           (PIO_S_PIO_MSKR_MSK2_ENABLED_Val << PIO_S_PIO_MSKR_MSK2_Pos) /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRX updates the corresponding I/O line configuration. Position  */
#define PIO_S_PIO_MSKR_MSK3_Pos               _UINT32_(3)                                          /* (PIO_S_PIO_MSKR) PIO Line 3 Mask Position */
#define PIO_S_PIO_MSKR_MSK3_Msk               (_UINT32_(0x1) << PIO_S_PIO_MSKR_MSK3_Pos)           /* (PIO_S_PIO_MSKR) PIO Line 3 Mask Mask */
#define PIO_S_PIO_MSKR_MSK3(value)            (PIO_S_PIO_MSKR_MSK3_Msk & (_UINT32_(value) << PIO_S_PIO_MSKR_MSK3_Pos)) /* Assigment of value for MSK3 in the PIO_S_PIO_MSKR register */
#define   PIO_S_PIO_MSKR_MSK3_DISABLED_Val    _UINT32_(0x0)                                        /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRx does not affect the corresponding I/O line configuration.  */
#define   PIO_S_PIO_MSKR_MSK3_ENABLED_Val     _UINT32_(0x1)                                        /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRX updates the corresponding I/O line configuration.  */
#define PIO_S_PIO_MSKR_MSK3_DISABLED          (PIO_S_PIO_MSKR_MSK3_DISABLED_Val << PIO_S_PIO_MSKR_MSK3_Pos) /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRx does not affect the corresponding I/O line configuration. Position  */
#define PIO_S_PIO_MSKR_MSK3_ENABLED           (PIO_S_PIO_MSKR_MSK3_ENABLED_Val << PIO_S_PIO_MSKR_MSK3_Pos) /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRX updates the corresponding I/O line configuration. Position  */
#define PIO_S_PIO_MSKR_MSK4_Pos               _UINT32_(4)                                          /* (PIO_S_PIO_MSKR) PIO Line 4 Mask Position */
#define PIO_S_PIO_MSKR_MSK4_Msk               (_UINT32_(0x1) << PIO_S_PIO_MSKR_MSK4_Pos)           /* (PIO_S_PIO_MSKR) PIO Line 4 Mask Mask */
#define PIO_S_PIO_MSKR_MSK4(value)            (PIO_S_PIO_MSKR_MSK4_Msk & (_UINT32_(value) << PIO_S_PIO_MSKR_MSK4_Pos)) /* Assigment of value for MSK4 in the PIO_S_PIO_MSKR register */
#define   PIO_S_PIO_MSKR_MSK4_DISABLED_Val    _UINT32_(0x0)                                        /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRx does not affect the corresponding I/O line configuration.  */
#define   PIO_S_PIO_MSKR_MSK4_ENABLED_Val     _UINT32_(0x1)                                        /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRX updates the corresponding I/O line configuration.  */
#define PIO_S_PIO_MSKR_MSK4_DISABLED          (PIO_S_PIO_MSKR_MSK4_DISABLED_Val << PIO_S_PIO_MSKR_MSK4_Pos) /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRx does not affect the corresponding I/O line configuration. Position  */
#define PIO_S_PIO_MSKR_MSK4_ENABLED           (PIO_S_PIO_MSKR_MSK4_ENABLED_Val << PIO_S_PIO_MSKR_MSK4_Pos) /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRX updates the corresponding I/O line configuration. Position  */
#define PIO_S_PIO_MSKR_MSK5_Pos               _UINT32_(5)                                          /* (PIO_S_PIO_MSKR) PIO Line 5 Mask Position */
#define PIO_S_PIO_MSKR_MSK5_Msk               (_UINT32_(0x1) << PIO_S_PIO_MSKR_MSK5_Pos)           /* (PIO_S_PIO_MSKR) PIO Line 5 Mask Mask */
#define PIO_S_PIO_MSKR_MSK5(value)            (PIO_S_PIO_MSKR_MSK5_Msk & (_UINT32_(value) << PIO_S_PIO_MSKR_MSK5_Pos)) /* Assigment of value for MSK5 in the PIO_S_PIO_MSKR register */
#define   PIO_S_PIO_MSKR_MSK5_DISABLED_Val    _UINT32_(0x0)                                        /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRx does not affect the corresponding I/O line configuration.  */
#define   PIO_S_PIO_MSKR_MSK5_ENABLED_Val     _UINT32_(0x1)                                        /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRX updates the corresponding I/O line configuration.  */
#define PIO_S_PIO_MSKR_MSK5_DISABLED          (PIO_S_PIO_MSKR_MSK5_DISABLED_Val << PIO_S_PIO_MSKR_MSK5_Pos) /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRx does not affect the corresponding I/O line configuration. Position  */
#define PIO_S_PIO_MSKR_MSK5_ENABLED           (PIO_S_PIO_MSKR_MSK5_ENABLED_Val << PIO_S_PIO_MSKR_MSK5_Pos) /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRX updates the corresponding I/O line configuration. Position  */
#define PIO_S_PIO_MSKR_MSK6_Pos               _UINT32_(6)                                          /* (PIO_S_PIO_MSKR) PIO Line 6 Mask Position */
#define PIO_S_PIO_MSKR_MSK6_Msk               (_UINT32_(0x1) << PIO_S_PIO_MSKR_MSK6_Pos)           /* (PIO_S_PIO_MSKR) PIO Line 6 Mask Mask */
#define PIO_S_PIO_MSKR_MSK6(value)            (PIO_S_PIO_MSKR_MSK6_Msk & (_UINT32_(value) << PIO_S_PIO_MSKR_MSK6_Pos)) /* Assigment of value for MSK6 in the PIO_S_PIO_MSKR register */
#define   PIO_S_PIO_MSKR_MSK6_DISABLED_Val    _UINT32_(0x0)                                        /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRx does not affect the corresponding I/O line configuration.  */
#define   PIO_S_PIO_MSKR_MSK6_ENABLED_Val     _UINT32_(0x1)                                        /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRX updates the corresponding I/O line configuration.  */
#define PIO_S_PIO_MSKR_MSK6_DISABLED          (PIO_S_PIO_MSKR_MSK6_DISABLED_Val << PIO_S_PIO_MSKR_MSK6_Pos) /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRx does not affect the corresponding I/O line configuration. Position  */
#define PIO_S_PIO_MSKR_MSK6_ENABLED           (PIO_S_PIO_MSKR_MSK6_ENABLED_Val << PIO_S_PIO_MSKR_MSK6_Pos) /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRX updates the corresponding I/O line configuration. Position  */
#define PIO_S_PIO_MSKR_MSK7_Pos               _UINT32_(7)                                          /* (PIO_S_PIO_MSKR) PIO Line 7 Mask Position */
#define PIO_S_PIO_MSKR_MSK7_Msk               (_UINT32_(0x1) << PIO_S_PIO_MSKR_MSK7_Pos)           /* (PIO_S_PIO_MSKR) PIO Line 7 Mask Mask */
#define PIO_S_PIO_MSKR_MSK7(value)            (PIO_S_PIO_MSKR_MSK7_Msk & (_UINT32_(value) << PIO_S_PIO_MSKR_MSK7_Pos)) /* Assigment of value for MSK7 in the PIO_S_PIO_MSKR register */
#define   PIO_S_PIO_MSKR_MSK7_DISABLED_Val    _UINT32_(0x0)                                        /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRx does not affect the corresponding I/O line configuration.  */
#define   PIO_S_PIO_MSKR_MSK7_ENABLED_Val     _UINT32_(0x1)                                        /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRX updates the corresponding I/O line configuration.  */
#define PIO_S_PIO_MSKR_MSK7_DISABLED          (PIO_S_PIO_MSKR_MSK7_DISABLED_Val << PIO_S_PIO_MSKR_MSK7_Pos) /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRx does not affect the corresponding I/O line configuration. Position  */
#define PIO_S_PIO_MSKR_MSK7_ENABLED           (PIO_S_PIO_MSKR_MSK7_ENABLED_Val << PIO_S_PIO_MSKR_MSK7_Pos) /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRX updates the corresponding I/O line configuration. Position  */
#define PIO_S_PIO_MSKR_MSK8_Pos               _UINT32_(8)                                          /* (PIO_S_PIO_MSKR) PIO Line 8 Mask Position */
#define PIO_S_PIO_MSKR_MSK8_Msk               (_UINT32_(0x1) << PIO_S_PIO_MSKR_MSK8_Pos)           /* (PIO_S_PIO_MSKR) PIO Line 8 Mask Mask */
#define PIO_S_PIO_MSKR_MSK8(value)            (PIO_S_PIO_MSKR_MSK8_Msk & (_UINT32_(value) << PIO_S_PIO_MSKR_MSK8_Pos)) /* Assigment of value for MSK8 in the PIO_S_PIO_MSKR register */
#define   PIO_S_PIO_MSKR_MSK8_DISABLED_Val    _UINT32_(0x0)                                        /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRx does not affect the corresponding I/O line configuration.  */
#define   PIO_S_PIO_MSKR_MSK8_ENABLED_Val     _UINT32_(0x1)                                        /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRX updates the corresponding I/O line configuration.  */
#define PIO_S_PIO_MSKR_MSK8_DISABLED          (PIO_S_PIO_MSKR_MSK8_DISABLED_Val << PIO_S_PIO_MSKR_MSK8_Pos) /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRx does not affect the corresponding I/O line configuration. Position  */
#define PIO_S_PIO_MSKR_MSK8_ENABLED           (PIO_S_PIO_MSKR_MSK8_ENABLED_Val << PIO_S_PIO_MSKR_MSK8_Pos) /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRX updates the corresponding I/O line configuration. Position  */
#define PIO_S_PIO_MSKR_MSK9_Pos               _UINT32_(9)                                          /* (PIO_S_PIO_MSKR) PIO Line 9 Mask Position */
#define PIO_S_PIO_MSKR_MSK9_Msk               (_UINT32_(0x1) << PIO_S_PIO_MSKR_MSK9_Pos)           /* (PIO_S_PIO_MSKR) PIO Line 9 Mask Mask */
#define PIO_S_PIO_MSKR_MSK9(value)            (PIO_S_PIO_MSKR_MSK9_Msk & (_UINT32_(value) << PIO_S_PIO_MSKR_MSK9_Pos)) /* Assigment of value for MSK9 in the PIO_S_PIO_MSKR register */
#define   PIO_S_PIO_MSKR_MSK9_DISABLED_Val    _UINT32_(0x0)                                        /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRx does not affect the corresponding I/O line configuration.  */
#define   PIO_S_PIO_MSKR_MSK9_ENABLED_Val     _UINT32_(0x1)                                        /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRX updates the corresponding I/O line configuration.  */
#define PIO_S_PIO_MSKR_MSK9_DISABLED          (PIO_S_PIO_MSKR_MSK9_DISABLED_Val << PIO_S_PIO_MSKR_MSK9_Pos) /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRx does not affect the corresponding I/O line configuration. Position  */
#define PIO_S_PIO_MSKR_MSK9_ENABLED           (PIO_S_PIO_MSKR_MSK9_ENABLED_Val << PIO_S_PIO_MSKR_MSK9_Pos) /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRX updates the corresponding I/O line configuration. Position  */
#define PIO_S_PIO_MSKR_MSK10_Pos              _UINT32_(10)                                         /* (PIO_S_PIO_MSKR) PIO Line 10 Mask Position */
#define PIO_S_PIO_MSKR_MSK10_Msk              (_UINT32_(0x1) << PIO_S_PIO_MSKR_MSK10_Pos)          /* (PIO_S_PIO_MSKR) PIO Line 10 Mask Mask */
#define PIO_S_PIO_MSKR_MSK10(value)           (PIO_S_PIO_MSKR_MSK10_Msk & (_UINT32_(value) << PIO_S_PIO_MSKR_MSK10_Pos)) /* Assigment of value for MSK10 in the PIO_S_PIO_MSKR register */
#define   PIO_S_PIO_MSKR_MSK10_DISABLED_Val   _UINT32_(0x0)                                        /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRx does not affect the corresponding I/O line configuration.  */
#define   PIO_S_PIO_MSKR_MSK10_ENABLED_Val    _UINT32_(0x1)                                        /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRX updates the corresponding I/O line configuration.  */
#define PIO_S_PIO_MSKR_MSK10_DISABLED         (PIO_S_PIO_MSKR_MSK10_DISABLED_Val << PIO_S_PIO_MSKR_MSK10_Pos) /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRx does not affect the corresponding I/O line configuration. Position  */
#define PIO_S_PIO_MSKR_MSK10_ENABLED          (PIO_S_PIO_MSKR_MSK10_ENABLED_Val << PIO_S_PIO_MSKR_MSK10_Pos) /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRX updates the corresponding I/O line configuration. Position  */
#define PIO_S_PIO_MSKR_MSK11_Pos              _UINT32_(11)                                         /* (PIO_S_PIO_MSKR) PIO Line 11 Mask Position */
#define PIO_S_PIO_MSKR_MSK11_Msk              (_UINT32_(0x1) << PIO_S_PIO_MSKR_MSK11_Pos)          /* (PIO_S_PIO_MSKR) PIO Line 11 Mask Mask */
#define PIO_S_PIO_MSKR_MSK11(value)           (PIO_S_PIO_MSKR_MSK11_Msk & (_UINT32_(value) << PIO_S_PIO_MSKR_MSK11_Pos)) /* Assigment of value for MSK11 in the PIO_S_PIO_MSKR register */
#define   PIO_S_PIO_MSKR_MSK11_DISABLED_Val   _UINT32_(0x0)                                        /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRx does not affect the corresponding I/O line configuration.  */
#define   PIO_S_PIO_MSKR_MSK11_ENABLED_Val    _UINT32_(0x1)                                        /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRX updates the corresponding I/O line configuration.  */
#define PIO_S_PIO_MSKR_MSK11_DISABLED         (PIO_S_PIO_MSKR_MSK11_DISABLED_Val << PIO_S_PIO_MSKR_MSK11_Pos) /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRx does not affect the corresponding I/O line configuration. Position  */
#define PIO_S_PIO_MSKR_MSK11_ENABLED          (PIO_S_PIO_MSKR_MSK11_ENABLED_Val << PIO_S_PIO_MSKR_MSK11_Pos) /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRX updates the corresponding I/O line configuration. Position  */
#define PIO_S_PIO_MSKR_MSK12_Pos              _UINT32_(12)                                         /* (PIO_S_PIO_MSKR) PIO Line 12 Mask Position */
#define PIO_S_PIO_MSKR_MSK12_Msk              (_UINT32_(0x1) << PIO_S_PIO_MSKR_MSK12_Pos)          /* (PIO_S_PIO_MSKR) PIO Line 12 Mask Mask */
#define PIO_S_PIO_MSKR_MSK12(value)           (PIO_S_PIO_MSKR_MSK12_Msk & (_UINT32_(value) << PIO_S_PIO_MSKR_MSK12_Pos)) /* Assigment of value for MSK12 in the PIO_S_PIO_MSKR register */
#define   PIO_S_PIO_MSKR_MSK12_DISABLED_Val   _UINT32_(0x0)                                        /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRx does not affect the corresponding I/O line configuration.  */
#define   PIO_S_PIO_MSKR_MSK12_ENABLED_Val    _UINT32_(0x1)                                        /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRX updates the corresponding I/O line configuration.  */
#define PIO_S_PIO_MSKR_MSK12_DISABLED         (PIO_S_PIO_MSKR_MSK12_DISABLED_Val << PIO_S_PIO_MSKR_MSK12_Pos) /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRx does not affect the corresponding I/O line configuration. Position  */
#define PIO_S_PIO_MSKR_MSK12_ENABLED          (PIO_S_PIO_MSKR_MSK12_ENABLED_Val << PIO_S_PIO_MSKR_MSK12_Pos) /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRX updates the corresponding I/O line configuration. Position  */
#define PIO_S_PIO_MSKR_MSK13_Pos              _UINT32_(13)                                         /* (PIO_S_PIO_MSKR) PIO Line 13 Mask Position */
#define PIO_S_PIO_MSKR_MSK13_Msk              (_UINT32_(0x1) << PIO_S_PIO_MSKR_MSK13_Pos)          /* (PIO_S_PIO_MSKR) PIO Line 13 Mask Mask */
#define PIO_S_PIO_MSKR_MSK13(value)           (PIO_S_PIO_MSKR_MSK13_Msk & (_UINT32_(value) << PIO_S_PIO_MSKR_MSK13_Pos)) /* Assigment of value for MSK13 in the PIO_S_PIO_MSKR register */
#define   PIO_S_PIO_MSKR_MSK13_DISABLED_Val   _UINT32_(0x0)                                        /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRx does not affect the corresponding I/O line configuration.  */
#define   PIO_S_PIO_MSKR_MSK13_ENABLED_Val    _UINT32_(0x1)                                        /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRX updates the corresponding I/O line configuration.  */
#define PIO_S_PIO_MSKR_MSK13_DISABLED         (PIO_S_PIO_MSKR_MSK13_DISABLED_Val << PIO_S_PIO_MSKR_MSK13_Pos) /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRx does not affect the corresponding I/O line configuration. Position  */
#define PIO_S_PIO_MSKR_MSK13_ENABLED          (PIO_S_PIO_MSKR_MSK13_ENABLED_Val << PIO_S_PIO_MSKR_MSK13_Pos) /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRX updates the corresponding I/O line configuration. Position  */
#define PIO_S_PIO_MSKR_MSK14_Pos              _UINT32_(14)                                         /* (PIO_S_PIO_MSKR) PIO Line 14 Mask Position */
#define PIO_S_PIO_MSKR_MSK14_Msk              (_UINT32_(0x1) << PIO_S_PIO_MSKR_MSK14_Pos)          /* (PIO_S_PIO_MSKR) PIO Line 14 Mask Mask */
#define PIO_S_PIO_MSKR_MSK14(value)           (PIO_S_PIO_MSKR_MSK14_Msk & (_UINT32_(value) << PIO_S_PIO_MSKR_MSK14_Pos)) /* Assigment of value for MSK14 in the PIO_S_PIO_MSKR register */
#define   PIO_S_PIO_MSKR_MSK14_DISABLED_Val   _UINT32_(0x0)                                        /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRx does not affect the corresponding I/O line configuration.  */
#define   PIO_S_PIO_MSKR_MSK14_ENABLED_Val    _UINT32_(0x1)                                        /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRX updates the corresponding I/O line configuration.  */
#define PIO_S_PIO_MSKR_MSK14_DISABLED         (PIO_S_PIO_MSKR_MSK14_DISABLED_Val << PIO_S_PIO_MSKR_MSK14_Pos) /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRx does not affect the corresponding I/O line configuration. Position  */
#define PIO_S_PIO_MSKR_MSK14_ENABLED          (PIO_S_PIO_MSKR_MSK14_ENABLED_Val << PIO_S_PIO_MSKR_MSK14_Pos) /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRX updates the corresponding I/O line configuration. Position  */
#define PIO_S_PIO_MSKR_MSK15_Pos              _UINT32_(15)                                         /* (PIO_S_PIO_MSKR) PIO Line 15 Mask Position */
#define PIO_S_PIO_MSKR_MSK15_Msk              (_UINT32_(0x1) << PIO_S_PIO_MSKR_MSK15_Pos)          /* (PIO_S_PIO_MSKR) PIO Line 15 Mask Mask */
#define PIO_S_PIO_MSKR_MSK15(value)           (PIO_S_PIO_MSKR_MSK15_Msk & (_UINT32_(value) << PIO_S_PIO_MSKR_MSK15_Pos)) /* Assigment of value for MSK15 in the PIO_S_PIO_MSKR register */
#define   PIO_S_PIO_MSKR_MSK15_DISABLED_Val   _UINT32_(0x0)                                        /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRx does not affect the corresponding I/O line configuration.  */
#define   PIO_S_PIO_MSKR_MSK15_ENABLED_Val    _UINT32_(0x1)                                        /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRX updates the corresponding I/O line configuration.  */
#define PIO_S_PIO_MSKR_MSK15_DISABLED         (PIO_S_PIO_MSKR_MSK15_DISABLED_Val << PIO_S_PIO_MSKR_MSK15_Pos) /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRx does not affect the corresponding I/O line configuration. Position  */
#define PIO_S_PIO_MSKR_MSK15_ENABLED          (PIO_S_PIO_MSKR_MSK15_ENABLED_Val << PIO_S_PIO_MSKR_MSK15_Pos) /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRX updates the corresponding I/O line configuration. Position  */
#define PIO_S_PIO_MSKR_MSK16_Pos              _UINT32_(16)                                         /* (PIO_S_PIO_MSKR) PIO Line 16 Mask Position */
#define PIO_S_PIO_MSKR_MSK16_Msk              (_UINT32_(0x1) << PIO_S_PIO_MSKR_MSK16_Pos)          /* (PIO_S_PIO_MSKR) PIO Line 16 Mask Mask */
#define PIO_S_PIO_MSKR_MSK16(value)           (PIO_S_PIO_MSKR_MSK16_Msk & (_UINT32_(value) << PIO_S_PIO_MSKR_MSK16_Pos)) /* Assigment of value for MSK16 in the PIO_S_PIO_MSKR register */
#define   PIO_S_PIO_MSKR_MSK16_DISABLED_Val   _UINT32_(0x0)                                        /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRx does not affect the corresponding I/O line configuration.  */
#define   PIO_S_PIO_MSKR_MSK16_ENABLED_Val    _UINT32_(0x1)                                        /* (PIO_S_PIO_MSKR) Writing the S_PIO_CFGRx, S_PIO_ODSRx or S_PIO_IOFRX updates the corresponding I/O line configuration.  */
