Microchip-MPLAB-Harmony/csp_apps_sam_a5d2/apps/mcan/mcan_fd_operation_blocking/firmware/src/packs/ATSAMA5D29_DFP/component/pio.h
#define PIO_S_PIO_SODR_P_Pos                  _UINT32_(0)                                          /* (PIO_S_PIO_SODR Position) Set Output Data */
#define PIO_S_PIO_SODR_P_Msk                  (_UINT32_(0xFFFFFFFF) << PIO_S_PIO_SODR_P_Pos)       /* (PIO_S_PIO_SODR Mask) P */
#define PIO_S_PIO_SODR_P(value)               (PIO_S_PIO_SODR_P_Msk & (_UINT32_(value) << PIO_S_PIO_SODR_P_Pos)) 

/* -------- PIO_VERSION : (PIO Offset: 0x5FC) ( R/ 32) PIO Version Register -------- */
#define PIO_VERSION_VERSION_Pos               _UINT32_(0)                                          /* (PIO_VERSION) Hardware Module Version Position */
#define PIO_VERSION_VERSION_Msk               (_UINT32_(0xFFF) << PIO_VERSION_VERSION_Pos)         /* (PIO_VERSION) Hardware Module Version Mask */
#define PIO_VERSION_VERSION(value)            (PIO_VERSION_VERSION_Msk & (_UINT32_(value) << PIO_VERSION_VERSION_Pos)) /* Assigment of value for VERSION in the PIO_VERSION register */
#define PIO_VERSION_MFN_Pos                   _UINT32_(16)                                         /* (PIO_VERSION) Metal Fix Number Position */
#define PIO_VERSION_MFN_Msk                   (_UINT32_(0x7) << PIO_VERSION_MFN_Pos)               /* (PIO_VERSION) Metal Fix Number Mask */
#define PIO_VERSION_MFN(value)                (PIO_VERSION_MFN_Msk & (_UINT32_(value) << PIO_VERSION_MFN_Pos)) /* Assigment of value for MFN in the PIO_VERSION register */
#define PIO_VERSION_Msk                       _UINT32_(0x00070FFF)                                 /* (PIO_VERSION) Register Mask  */


/* -------- PIO_WPMR : (PIO Offset: 0x5E0) (R/W 32) PIO Write Protection Mode Register -------- */
#define PIO_WPMR_WPEN_Pos                     _UINT32_(0)                                          /* (PIO_WPMR) Write Protection Enable Position */
#define PIO_WPMR_WPEN_Msk                     (_UINT32_(0x1) << PIO_WPMR_WPEN_Pos)                 /* (PIO_WPMR) Write Protection Enable Mask */
#define PIO_WPMR_WPEN(value)                  (PIO_WPMR_WPEN_Msk & (_UINT32_(value) << PIO_WPMR_WPEN_Pos)) /* Assigment of value for WPEN in the PIO_WPMR register */
#define PIO_WPMR_WPKEY_Pos                    _UINT32_(8)                                          /* (PIO_WPMR) Write Protection Key Position */
#define PIO_WPMR_WPKEY_Msk                    (_UINT32_(0xFFFFFF) << PIO_WPMR_WPKEY_Pos)           /* (PIO_WPMR) Write Protection Key Mask */
#define PIO_WPMR_WPKEY(value)                 (PIO_WPMR_WPKEY_Msk & (_UINT32_(value) << PIO_WPMR_WPKEY_Pos)) /* Assigment of value for WPKEY in the PIO_WPMR register */
#define   PIO_WPMR_WPKEY_PASSWD_Val           _UINT32_(0x50494F)                                   /* (PIO_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.  */
#define PIO_WPMR_WPKEY_PASSWD                 (PIO_WPMR_WPKEY_PASSWD_Val << PIO_WPMR_WPKEY_Pos)    /* (PIO_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0. Position  */
#define PIO_WPMR_Msk                          _UINT32_(0xFFFFFF01)                                 /* (PIO_WPMR) Register Mask  */


/* -------- PIO_WPSR : (PIO Offset: 0x5E4) ( R/ 32) PIO Write Protection Status Register -------- */
#define PIO_WPSR_WPVS_Pos                     _UINT32_(0)                                          /* (PIO_WPSR) Write Protection Violation Status Position */
#define PIO_WPSR_WPVS_Msk                     (_UINT32_(0x1) << PIO_WPSR_WPVS_Pos)                 /* (PIO_WPSR) Write Protection Violation Status Mask */
#define PIO_WPSR_WPVS(value)                  (PIO_WPSR_WPVS_Msk & (_UINT32_(value) << PIO_WPSR_WPVS_Pos)) /* Assigment of value for WPVS in the PIO_WPSR register */
#define PIO_WPSR_WPVSRC_Pos                   _UINT32_(8)                                          /* (PIO_WPSR) Write Protection Violation Source Position */
#define PIO_WPSR_WPVSRC_Msk                   (_UINT32_(0xFFFF) << PIO_WPSR_WPVSRC_Pos)            /* (PIO_WPSR) Write Protection Violation Source Mask */
#define PIO_WPSR_WPVSRC(value)                (PIO_WPSR_WPVSRC_Msk & (_UINT32_(value) << PIO_WPSR_WPVSRC_Pos)) /* Assigment of value for WPVSRC in the PIO_WPSR register */
#define PIO_WPSR_Msk                          _UINT32_(0x00FFFF01)                                 /* (PIO_WPSR) Register Mask  */


/* -------- PIO_S_PIO_SCDR : (PIO Offset: 0x1500) (R/W 32) Secure PIO Slow Clock Divider Debouncing Register -------- */
#define PIO_S_PIO_SCDR_DIV_Pos                _UINT32_(0)                                          /* (PIO_S_PIO_SCDR) Slow Clock Divider Selection for Debouncing Position */
#define PIO_S_PIO_SCDR_DIV_Msk                (_UINT32_(0x3FFF) << PIO_S_PIO_SCDR_DIV_Pos)         /* (PIO_S_PIO_SCDR) Slow Clock Divider Selection for Debouncing Mask */
#define PIO_S_PIO_SCDR_DIV(value)             (PIO_S_PIO_SCDR_DIV_Msk & (_UINT32_(value) << PIO_S_PIO_SCDR_DIV_Pos)) /* Assigment of value for DIV in the PIO_S_PIO_SCDR register */
#define PIO_S_PIO_SCDR_Msk                    _UINT32_(0x00003FFF)                                 /* (PIO_S_PIO_SCDR) Register Mask  */


/* -------- PIO_S_PIO_WPMR : (PIO Offset: 0x15E0) (R/W 32) Secure PIO Write Protection Mode Register -------- */
#define PIO_S_PIO_WPMR_WPEN_Pos               _UINT32_(0)                                          /* (PIO_S_PIO_WPMR) Write Protection Enable Position */
#define PIO_S_PIO_WPMR_WPEN_Msk               (_UINT32_(0x1) << PIO_S_PIO_WPMR_WPEN_Pos)           /* (PIO_S_PIO_WPMR) Write Protection Enable Mask */
#define PIO_S_PIO_WPMR_WPEN(value)            (PIO_S_PIO_WPMR_WPEN_Msk & (_UINT32_(value) << PIO_S_PIO_WPMR_WPEN_Pos)) /* Assigment of value for WPEN in the PIO_S_PIO_WPMR register */
#define PIO_S_PIO_WPMR_WPKEY_Pos              _UINT32_(8)                                          /* (PIO_S_PIO_WPMR) Write Protection Key Position */
#define PIO_S_PIO_WPMR_WPKEY_Msk              (_UINT32_(0xFFFFFF) << PIO_S_PIO_WPMR_WPKEY_Pos)     /* (PIO_S_PIO_WPMR) Write Protection Key Mask */
#define PIO_S_PIO_WPMR_WPKEY(value)           (PIO_S_PIO_WPMR_WPKEY_Msk & (_UINT32_(value) << PIO_S_PIO_WPMR_WPKEY_Pos)) /* Assigment of value for WPKEY in the PIO_S_PIO_WPMR register */
#define   PIO_S_PIO_WPMR_WPKEY_PASSWD_Val     _UINT32_(0x50494F)                                   /* (PIO_S_PIO_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.  */
#define PIO_S_PIO_WPMR_WPKEY_PASSWD           (PIO_S_PIO_WPMR_WPKEY_PASSWD_Val << PIO_S_PIO_WPMR_WPKEY_Pos) /* (PIO_S_PIO_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0. Position  */
#define PIO_S_PIO_WPMR_Msk                    _UINT32_(0xFFFFFF01)                                 /* (PIO_S_PIO_WPMR) Register Mask  */


/* -------- PIO_S_PIO_WPSR : (PIO Offset: 0x15E4) ( R/ 32) Secure PIO Write Protection Status Register -------- */
#define PIO_S_PIO_WPSR_WPVS_Pos               _UINT32_(0)                                          /* (PIO_S_PIO_WPSR) Write Protection Violation Status Position */
#define PIO_S_PIO_WPSR_WPVS_Msk               (_UINT32_(0x1) << PIO_S_PIO_WPSR_WPVS_Pos)           /* (PIO_S_PIO_WPSR) Write Protection Violation Status Mask */
#define PIO_S_PIO_WPSR_WPVS(value)            (PIO_S_PIO_WPSR_WPVS_Msk & (_UINT32_(value) << PIO_S_PIO_WPSR_WPVS_Pos)) /* Assigment of value for WPVS in the PIO_S_PIO_WPSR register */
#define PIO_S_PIO_WPSR_WPVSRC_Pos             _UINT32_(8)                                          /* (PIO_S_PIO_WPSR) Write Protection Violation Source Position */
#define PIO_S_PIO_WPSR_WPVSRC_Msk             (_UINT32_(0xFFFF) << PIO_S_PIO_WPSR_WPVSRC_Pos)      /* (PIO_S_PIO_WPSR) Write Protection Violation Source Mask */
#define PIO_S_PIO_WPSR_WPVSRC(value)          (PIO_S_PIO_WPSR_WPVSRC_Msk & (_UINT32_(value) << PIO_S_PIO_WPSR_WPVSRC_Pos)) /* Assigment of value for WPVSRC in the PIO_S_PIO_WPSR register */
#define PIO_S_PIO_WPSR_Msk                    _UINT32_(0x00FFFF01)                                 /* (PIO_S_PIO_WPSR) Register Mask  */


/** \brief PIO register offsets definitions */
#define PIO_CFGR_REG_OFST              _UINT32_(0x04)      /* (PIO_CFGR) PIO Configuration Register Offset */
#define PIO_CODR_REG_OFST              _UINT32_(0x14)      /* (PIO_CODR) PIO Clear Output Data Register Offset */
#define PIO_IDR_REG_OFST               _UINT32_(0x24)      /* (PIO_IDR) PIO Interrupt Disable Register Offset */
#define PIO_IER_REG_OFST               _UINT32_(0x20)      /* (PIO_IER) PIO Interrupt Enable Register Offset */
#define PIO_IMR_REG_OFST               _UINT32_(0x28)      /* (PIO_IMR) PIO Interrupt Mask Register Offset */
#define PIO_IOFR_REG_OFST              _UINT32_(0x3C)      /* (PIO_IOFR) PIO I/O Freeze Configuration Register Offset */
#define PIO_ISR_REG_OFST               _UINT32_(0x2C)      /* (PIO_ISR) PIO Interrupt Status Register Offset */
#define PIO_LOCKSR_REG_OFST            _UINT32_(0x0C)      /* (PIO_LOCKSR) PIO Lock Status Register Offset */
#define PIO_MSKR_REG_OFST              _UINT32_(0x00)      /* (PIO_MSKR) PIO Mask Register Offset */
#define PIO_ODSR_REG_OFST              _UINT32_(0x18)      /* (PIO_ODSR) PIO Output Data Status Register Offset */
#define PIO_PDSR_REG_OFST              _UINT32_(0x08)      /* (PIO_PDSR) PIO Pin Data Status Register Offset */
#define PIO_SODR_REG_OFST              _UINT32_(0x10)      /* (PIO_SODR) PIO Set Output Data Register Offset */
#define PIO_S_PIO_CFGR_REG_OFST        _UINT32_(0x04)      /* (PIO_S_PIO_CFGR) Secure PIO Configuration Register Offset */
#define PIO_S_PIO_CODR_REG_OFST        _UINT32_(0x14)      /* (PIO_S_PIO_CODR) Secure PIO Clear Output Data Register Offset */
#define PIO_S_PIO_IDR_REG_OFST         _UINT32_(0x24)      /* (PIO_S_PIO_IDR) Secure PIO Interrupt Disable Register Offset */
#define PIO_S_PIO_IER_REG_OFST         _UINT32_(0x20)      /* (PIO_S_PIO_IER) Secure PIO Interrupt Enable Register Offset */
#define PIO_S_PIO_IMR_REG_OFST         _UINT32_(0x28)      /* (PIO_S_PIO_IMR) Secure PIO Interrupt Mask Register Offset */
#define PIO_S_PIO_IOFR_REG_OFST        _UINT32_(0x3C)      /* (PIO_S_PIO_IOFR) Secure PIO I/O Freeze Configuration Register Offset */
#define PIO_S_PIO_IOSSR_REG_OFST       _UINT32_(0x38)      /* (PIO_S_PIO_IOSSR) Secure PIO I/O Security Status Register Offset */
#define PIO_S_PIO_ISR_REG_OFST         _UINT32_(0x2C)      /* (PIO_S_PIO_ISR) Secure PIO Interrupt Status Register Offset */
#define PIO_S_PIO_LOCKSR_REG_OFST      _UINT32_(0x0C)      /* (PIO_S_PIO_LOCKSR) Secure PIO Lock Status Register Offset */
#define PIO_S_PIO_MSKR_REG_OFST        _UINT32_(0x00)      /* (PIO_S_PIO_MSKR) Secure PIO Mask Register Offset */
#define PIO_S_PIO_ODSR_REG_OFST        _UINT32_(0x18)      /* (PIO_S_PIO_ODSR) Secure PIO Output Data Status Register Offset */
#define PIO_S_PIO_PDSR_REG_OFST        _UINT32_(0x08)      /* (PIO_S_PIO_PDSR) Secure PIO Pin Data Status Register Offset */
#define PIO_S_PIO_SIONR_REG_OFST       _UINT32_(0x30)      /* (PIO_S_PIO_SIONR) Secure PIO Set I/O Non-Secure Register Offset */
#define PIO_S_PIO_SIOSR_REG_OFST       _UINT32_(0x34)      /* (PIO_S_PIO_SIOSR) Secure PIO Set I/O Secure Register Offset */
#define PIO_S_PIO_SODR_REG_OFST        _UINT32_(0x10)      /* (PIO_S_PIO_SODR) Secure PIO Set Output Data Register Offset */
#define PIO_VERSION_REG_OFST           _UINT32_(0x5FC)     /* (PIO_VERSION) PIO Version Register Offset */
#define PIO_WPMR_REG_OFST              _UINT32_(0x5E0)     /* (PIO_WPMR) PIO Write Protection Mode Register Offset */
#define PIO_WPSR_REG_OFST              _UINT32_(0x5E4)     /* (PIO_WPSR) PIO Write Protection Status Register Offset */
#define PIO_S_PIO_SCDR_REG_OFST        _UINT32_(0x1500)    /* (PIO_S_PIO_SCDR) Secure PIO Slow Clock Divider Debouncing Register Offset */
#define PIO_S_PIO_WPMR_REG_OFST        _UINT32_(0x15E0)    /* (PIO_S_PIO_WPMR) Secure PIO Write Protection Mode Register Offset */
#define PIO_S_PIO_WPSR_REG_OFST        _UINT32_(0x15E4)    /* (PIO_S_PIO_WPSR) Secure PIO Write Protection Status Register Offset */

