Microchip-MPLAB-Harmony/csp_apps_sam_a5d2/apps/mcan/mcan_fd_operation_blocking/firmware/src/packs/ATSAMA5D29_DFP/component/pio.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief PIO_GROUP register API structure */
typedef struct
{
  __IO  uint32_t                       PIO_MSKR;           /**< Offset: 0x00 (R/W  32) PIO Mask Register */
  __IO  uint32_t                       PIO_CFGR;           /**< Offset: 0x04 (R/W  32) PIO Configuration Register */
  __I   uint32_t                       PIO_PDSR;           /**< Offset: 0x08 (R/   32) PIO Pin Data Status Register */
  __I   uint32_t                       PIO_LOCKSR;         /**< Offset: 0x0C (R/   32) PIO Lock Status Register */
  __O   uint32_t                       PIO_SODR;           /**< Offset: 0x10 ( /W  32) PIO Set Output Data Register */
  __O   uint32_t                       PIO_CODR;           /**< Offset: 0x14 ( /W  32) PIO Clear Output Data Register */
  __IO  uint32_t                       PIO_ODSR;           /**< Offset: 0x18 (R/W  32) PIO Output Data Status Register */
  __I   uint8_t                        Reserved1[0x04];
  __O   uint32_t                       PIO_IER;            /**< Offset: 0x20 ( /W  32) PIO Interrupt Enable Register */
  __O   uint32_t                       PIO_IDR;            /**< Offset: 0x24 ( /W  32) PIO Interrupt Disable Register */
  __I   uint32_t                       PIO_IMR;            /**< Offset: 0x28 (R/   32) PIO Interrupt Mask Register */
  __I   uint32_t                       PIO_ISR;            /**< Offset: 0x2C (R/   32) PIO Interrupt Status Register */
  __I   uint8_t                        Reserved2[0x0C];
  __O   uint32_t                       PIO_IOFR;           /**< Offset: 0x3C ( /W  32) PIO I/O Freeze Configuration Register */
} pio_group_registers_t;

/** \brief PIO_SGROUP register API structure */
typedef struct
{
  __IO  uint32_t                       PIO_S_PIO_MSKR;     /**< Offset: 0x00 (R/W  32) Secure PIO Mask Register */
  __IO  uint32_t                       PIO_S_PIO_CFGR;     /**< Offset: 0x04 (R/W  32) Secure PIO Configuration Register */
  __I   uint32_t                       PIO_S_PIO_PDSR;     /**< Offset: 0x08 (R/   32) Secure PIO Pin Data Status Register */
  __I   uint32_t                       PIO_S_PIO_LOCKSR;   /**< Offset: 0x0C (R/   32) Secure PIO Lock Status Register */
  __O   uint32_t                       PIO_S_PIO_SODR;     /**< Offset: 0x10 ( /W  32) Secure PIO Set Output Data Register */
  __O   uint32_t                       PIO_S_PIO_CODR;     /**< Offset: 0x14 ( /W  32) Secure PIO Clear Output Data Register */
  __IO  uint32_t                       PIO_S_PIO_ODSR;     /**< Offset: 0x18 (R/W  32) Secure PIO Output Data Status Register */
  __I   uint8_t                        Reserved1[0x04];
  __O   uint32_t                       PIO_S_PIO_IER;      /**< Offset: 0x20 ( /W  32) Secure PIO Interrupt Enable Register */
  __O   uint32_t                       PIO_S_PIO_IDR;      /**< Offset: 0x24 ( /W  32) Secure PIO Interrupt Disable Register */
  __I   uint32_t                       PIO_S_PIO_IMR;      /**< Offset: 0x28 (R/   32) Secure PIO Interrupt Mask Register */
  __I   uint32_t                       PIO_S_PIO_ISR;      /**< Offset: 0x2C (R/   32) Secure PIO Interrupt Status Register */
  __O   uint32_t                       PIO_S_PIO_SIONR;    /**< Offset: 0x30 ( /W  32) Secure PIO Set I/O Non-Secure Register */
  __O   uint32_t                       PIO_S_PIO_SIOSR;    /**< Offset: 0x34 ( /W  32) Secure PIO Set I/O Secure Register */
  __I   uint32_t                       PIO_S_PIO_IOSSR;    /**< Offset: 0x38 (R/   32) Secure PIO I/O Security Status Register */
  __O   uint32_t                       PIO_S_PIO_IOFR;     /**< Offset: 0x3C ( /W  32) Secure PIO I/O Freeze Configuration Register */
} pio_sgroup_registers_t;

#define PIO_GROUP_NUMBER 4

#define PIO_SGROUP_NUMBER 4

/** \brief PIO register API structure */
typedef struct
{
        pio_group_registers_t          PIO_GROUP[PIO_GROUP_NUMBER]; /**< Offset: 0x00  */
  __I   uint8_t                        Reserved1[0x4E0];
  __IO  uint32_t                       PIO_WPMR;           /**< Offset: 0x5E0 (R/W  32) PIO Write Protection Mode Register */
  __I   uint32_t                       PIO_WPSR;           /**< Offset: 0x5E4 (R/   32) PIO Write Protection Status Register */
  __I   uint8_t                        Reserved2[0x14];
  __I   uint32_t                       PIO_VERSION;        /**< Offset: 0x5FC (R/   32) PIO Version Register */
  __I   uint8_t                        Reserved3[0xA00];
        pio_sgroup_registers_t         PIO_SGROUP[PIO_SGROUP_NUMBER]; /**< Offset: 0x1000  */
  __I   uint8_t                        Reserved4[0x400];
  __IO  uint32_t                       PIO_S_PIO_SCDR;     /**< Offset: 0x1500 (R/W  32) Secure PIO Slow Clock Divider Debouncing Register */
  __I   uint8_t                        Reserved5[0xDC];
  __IO  uint32_t                       PIO_S_PIO_WPMR;     /**< Offset: 0x15E0 (R/W  32) Secure PIO Write Protection Mode Register */
  __I   uint32_t                       PIO_S_PIO_WPSR;     /**< Offset: 0x15E4 (R/   32) Secure PIO Write Protection Status Register */
} pio_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMA5D_PIO_COMPONENT_H_ */
